[
 { "year": 1, "chapter": "01" ,"synopsis": "Driving up the coast to her new KCON reporting job, Morrigan McBride experiences mysterious car trouble and breaks down on the outskirts of town. She is forced to spend the night in her car by the side of the road. \n\nThe next morning, only more problems ensue as she meets up with her idiosyncratic field producer/camerawoman, Gracie Takanachi, and is forced to go to work early, covering Duquesa Bay's latest multiple homicide."},
 { "year": 1, "chapter": "02" ,"synopsis": "Inside the mansion of the rich and powerful von Meer family, Dr. Erika von Meer recovers from her transformation and joins her eccentric clan at the breakfast table. They watch the breaking news of the murders as Morrigan makes her first on-air KCON appearance. \n\nErika returns to her lab at the University where Griffin Martel pesters her into having dinner with him that night. After making the date with Dr. von Meer, Griffin makes certain that there is no connection between him and the men on the boat."},
 { "year": 1, "chapter": "03" ,"synopsis": "Recovering from the previous night and hectic morning, Morrigan and Gracie, along with Zach Isaacson of the Daily Beacon, prepare to attend a joint news conference on the murders by the county sheriff and the United States Coast Guard. \n\nCaptain Craig Phelps and Lieutenant Anita Fiore of the USCG try to come up with just enough information for the public while continuing to sit on the facts about the real body count over the last few years.\n\nJust as the press conference is about to begin, there's word of a serious train wreck with oil leaking into the Santa Conchita River."},
 { "year": 1, "chapter": "04" ,"synopsis": "Erika is at dinner with Griffin when she sees the news report on the train wreck. She excuses herself from her dinner, strips and dives into the ocean, transforming into her alter ego... Darkfin!"},
 { "year": 1, "chapter": "05" ,"synopsis": "All the principles rush to the train accident. As the authorities bicker and delay a response, Darkfin decides to ignite the oil slick before it can hit the bay. Meanwhile Morrigan spots a man in the wreckage and goes to help him. Darkfin charges her trident and throws it into the oil causing a huge fireball..."},
 { "year": 1, "chapter": "06" ,"synopsis": "Zach and Gracie fear the worst as Morrigan is blown into the river. In the middle of her \"meeting\" with network executives, Kylee Shepperton is urgently called back by her boss, Turner Gates. Craig and Anita circle the scene in a helicopter, trying to figure out who set fire to the oil slick, while Dr. Javier Sanchez and Dr. Shelby Willis try to assess the damage and look for Erika. Morrigan somehow manages to make it to shore. Anita spots Darkfin in the water and dives out of the helicopter after her."},
 { "year": 1, "chapter": "07" ,"synopsis": "Erika struggles with her incomplete transformation back from Darkfin and slowly makes her way to Bay Valley Medical Center. Awakening in the hospital, Morrigan tries to convince Gracie and Zach about the hand she saw from her dream. Afterwards, she deals with the individual agendas of Turner, Kylee, and her sickbed roomie, Anita. Mystery in the Kiyomi Mountains."},
 { "year": 1, "chapter": "08" ,"synopsis": "Erika finally completes the change back from Darkfin by stealing the necessary materials from a medical supply room. Dr. Stephanie Gates walks in and confronts her. Anita pesters Morrigan with questions about the explosion and \"Aleta Obscura.\" McBride seeks refuge in the hall and literally runs into Erika, the vending machine victor. More mystery in the Kiyomis."},
 { "year": 1, "chapter": "09" ,"synopsis": "Zach and Gracie bust Morrigan out of the hospital and show her the footage of the \"blue flash\" igniting the oil slick. While trying to decide on a costume for the museum ball, KJ butts heads with his father, questions his sister, and makes a date. After dealing with perplexing goo and the bathroom habits of the rich and famous, Morrigan finally settles into her new house with Amethyst and Roshumba."},
 { "year": 1, "chapter": "10" ,"synopsis": "Erika ponders on her boat in the bay while Morrigan slowly adjusts to her KCON surroundings and co-workers. Information about the Celoso Beach murders, as well as a tasty basket of clams, is served at Captain Dave's Seafood Shack. Morrigan ends up at Santa Conchita University's Biology & Aquatics Department and asks Dr. Sanchez to run the sample for her. It ends up in the hands of Dr. von Meer."},
 { "year": 1, "chapter": "11" ,"synopsis": "Penny Renselier and her friends awaken after a heavy night of partying. Enjoying breakfast with Amethyst, Morrigan eagerly awaits the test results while she considers a rack of expensive ball costumes from KJ. Sandy and Ona Rosa Sanchez start the morning off right but quickly get into a disagreement. Captain Phelps and Lieutenant Fiore deal with a broken door, pirate costumes and fun with an ironing board. Erika and KJ share the usual sibling strife. Mysterious plans are made for the museum ball. "},
 { "year": 1, "chapter": "12" ,"synopsis": "Jeremy, Turner, Zach and Morrigan interrupt Gracie Takanachi's harmless \"Sigma Seven\" obsession. Lydia and Penny Renselier share a unique mother/daughter moment while intrigue takes place at the Quartz County Museum. Unhappy with the test results, Morrigan confronts Tim Hajanian over the supposed smelt innards and discovers a beneficial secret."},
 { "year": 1, "chapter": "13" ,"synopsis": "Everyone gets ready and attends the costume party at the museum. Both Morrigan and Erika sense something is wrong with the security guards and they are quickly proven right."},
 { "year": 1, "chapter": "14" ,"synopsis": "The Duquesa's Tears are stolen as pandemonium breaks out. There are several injured, including Lydia. Darkfin takes on the security guards as Morrigan goes after a mysterious hooded man."},
 { "year": 1, "chapter": "15" ,"synopsis": "After Penny makes sure her mom is safe, she goes after her father, Brad and Jeremy. Gracie and Zach wonder where Morrigan is. The hooded man toys with McBride. This leads to another encounter with Darkfin who is able to recover most of the pearl necklace. Above in the helicopter, Craig and Anita find Morrigan passed out on shore."},
 { "year": 1, "chapter": "16" ,"synopsis": "Fun at the county morgue with Zach, Gracie, Morrigan, the Mirabello twins and the dead bodies from the museum."},
 { "year": 1, "chapter": "17" ,"synopsis": "The Martels enjoy a lively breakfast and a round of golf. Erika tries to enjoy a game of chess with Big Joe and Griffin definitely enjoys the bed with Kylee."},
 { "year": 1, "chapter": "18" ,"synopsis": "A Bulgarian ship docked in the bay is about to unload its cargo of illegal weapons but Darkfin has other plans. Anita and Ona Rosa attempt to have a quite family meal with Craig in tow but the captain and the lieutenant are called away to the ship where Morrigan shows up for a KCON report."},
 { "year": 1, "chapter": "19" ,"synopsis": "With his father and Karl Senior watching, Griffin gives a press conference about the incident. Morrigan is enjoying the company of her cherished tarantula when Gracie, Amethyst, and then Tim interrupt her day off. Tim's test results are not surprising but still require Morrigan to head to SCU's library for further research. She runs into Erika who is doing research of her own."},
 { "year": 1, "chapter": "20" ,"synopsis": "Griffin tries his best to sooth a preoccupied Erika. Penny has fun with both Jeremy and Brad. After a lively lunch at Muldoon's, Morrigan relaxes on a sunset hike with KJ in the Kiyomis and hears the legend of Duquesa Bay. After KJ takes off, Morrigan is now alone in the middle of a storm with a hooded figure. After giving chase, she finally comes face to face with Darkfin!"},
 { "year": 2, "chapter": "01" ,"synopsis": "Investigating the Kiyomi mountains, Morrigan comes face to face with Darkfin for the first time. As they search deeper into a cave, the two are discovered by the mysterious hooded figures. Morrigan is caught and her triskele birthmark is revealed by the hooded leader. Darkfin manages to escape with an unconscious Morrigan."},
 { "year": 2, "chapter": "02" ,"synopsis": "Inside her secret lab under the island of Concha Dos, Erika ponders her past as she does research into Morrigan's mark and a new fighting power. She morphs into Darkfin to try out her concussive skill."},
 { "year": 2, "chapter": "03" ,"synopsis": "Craig and Anita comb the coastal waters in search of Darkfin clues and come across Doug Martel's disabled yacht with the Sigma Seven cast party on board. There's a lively exchange between Doug and his wife, Ursula, while Anita finds a new foil in Marcy Nolan."},
 { "year": 2, "chapter": "04" ,"synopsis": "Griffin goes before the Pacific Coast Oil Consortium board to discuss something besides regular business. Morrigan waits to interview him but encounters Erika instead. She invites her to dinner later at the club. Morrigan accepts and learns what she needs to know from observing KJ with Griffin."},
 { "year": 2, "chapter": "05" ,"synopsis": "Morrigan continues to take walks along the beach, hoping to encounter Darkfin but runs into Karl Senior instead. Awhile later, Darkfin finally appears. Morrigan is tested with the trident as two hooded figures observe. Darkfin takes them on with her new power and escapes with Morrigan in the car."},
 { "year": 2, "chapter": "06" ,"synopsis": "While working at KCON, Morrigan suddenly realizes that her gun is missing. Moments later, she receives a mysterious instant message from \"Anon1\" asking to meet. Morrigan clashes with Gracie over her Sigma 7 obsession and the ability to track the IM. Jason Clark comes over with a suspicious bruise on his hand."},
 { "year": 2, "chapter": "07" ,"synopsis": "Dr. Stephanie Gates conducts some tests on Morrigan and is later confronted by Hector Tapia. A curious Darkfin meets up with Morrigan at the beach. She convinces the reporter with the fluctuating body temperature to undergo more medical tests at her secret lab in exchange for more information. "},
 { "year": 2, "chapter": "08" ,"synopsis": "In Coast Guard helicopter, Craig and Anita search for signs of Darkfin in the bay. Craig admits to having an affair with Mrs. Martel. After a lively swim, Morrigan and Darkfin are now in a lair on the island of Concha Dos. The two discuss Nereidium. An illegal fishing boat incident brings everyone to the same location."},
 { "year": 2, "chapter": "09" ,"synopsis": "Dr. Javier Sanchez, suspicious of his co-worker, searches through Erika's office and computer. Erika flashes back to a time in Sri Lanka with Samadara. Darkfin contacts Morrigan by IM and is reminded of her promise to break into Griffin Martel's office."},
 { "year": 2, "chapter": "10" ,"synopsis": "As Morrigan leaves for the evening, Amy confronts her. Now at the Meer-A-Mar Headquarters, Morrigan prepares to break in along with Darkfin's help. They find out certain information but are interrupted by Griffin. Trying to escape, they run into the hooded goons and KJ. "},
 { "year": 2, "chapter": "11" ,"synopsis": "Joenne Mirabello observes the hooded leader as it speaks with another. Morrigan attempts to enjoy an evening of socializing with KJ, Gracie, Zach, Justine and Jason but abruptly leaves after sharing a family secret. At Saint Brendan's Catholic Church, Frank and Carmen Fiore discuss matters with Hector Tapia as he waits for Morrigan to show up. Before she can go inside the church, Morrigan is confronted by Joenne."},
 { "year": 2, "chapter": "12" ,"synopsis": "Griffin Martel discusses Meeramar business as a bored Erika and KJ look on. Joenne reveals her covert ties to the U.S. government and gives a little information about \"The Clergy\" to Morrigan but is seemingly unaware of Darkfin's existence. Hector catches Morrigan as she returns to her car, she makes an excuse and leaves. Father Greg is shot in the chest and dies."},
 { "year": 2, "chapter": "13" ,"synopsis": "Anita is over at Kylee's when they hear about the shooting. Erika takes Griffin's car and zooms off to the church. As Gracie and Jeremy discuss life and music, Zach arrives and tells them the news. Morrigan and Erika get into a car accident with each other. Eventually, everyone gathers at the church where Morrigan instantly recognizes her stolen gun as the murder weapon."},
 { "year": 2, "chapter": "14" ,"synopsis": "Morrigan is grilled by two Santa Conchita Police detectives regarding the murder of Father Greg. They are trying to set her up as the main suspect. Joenne pulls Morrigan aside and tells her to keep quiet about their meeting and that she is on her own with this problem. Erika observes the situation and is ready to do whatever it takes to keep Morrigan safe."},
 { "year": 2, "chapter": "15" ,"synopsis": "The Clergy continue to plot against Morrigan and Darkfin. KJ lets a brooding Erika off at the beach and drives Morrigan back to her house. After coaxing him to leave, she goes inside and discovers a disturbed Amy waiting for her. Morrigan plays her messages back and is on suspension from KCON. The Fiore family discusses the events of the evening and the possibility of Frank being a suspect. Anita and Craig leave to see if Morrigan goes to meet Darkfin."},
 { "year": 2, "chapter": "16" ,"synopsis": "Erika and Griffin discuss personal and professional matters over the phone. As Griffin hangs up, he is brought a special drill bit that is essential to his PCOC plans. Doug Martel is meeting with some business associates at the polo club when his private detective confirms his suspicions about Ursula. After a business conference with his son and Erika, Doug follows Ursula to Craig's apartment and violently confronts them."},
 { "year": 2, "chapter": "17" ,"synopsis": "At the doughnut shop, Gracie and Zach have a lively discussion about Morrigan and the crazy happenings of late. Gracie admits to tampering with Morrigan's computer at KCON. Morrigan arrives and pumps them both for information about the Mirabello twins. Justine checks out the body of Father Greg and makes some startling discoveries."},
 { "year": 2, "chapter": "18" ,"synopsis": "Erika and KJ have a long conversation about the murder case. As KJ leaves to meet their parents for dinner, Erika tries out an experiment on herself with unexpected results. Ben and his children enjoy a BBQ that Darkfin nearly spoils. Joenne takes Morrigan to the ancient burial grounds where the two discuss the Chumash myths and the situation with The Clergy."},
 { "year": 2, "chapter": "19" ,"synopsis": "Morrigan sends an instant message to an ailing Darkfin. Feeling ill herself, Morrigan falls asleep and is terrorized by bizarre nightmares. She awakens to find a naked Amy in her room with a glowing crystal around her neck. Joenne tells Zach about her Father Greg test results. Karl Senior suddenly collapses during dinner. Gracie discovers Jason using Morrigan's computer and confronts him. A hooded figure emerges from the elevator and heads in their direction."},
 { "year": 2, "chapter": "20" ,"synopsis": "Against better judgment, Darkfin heads back to shore. The saltwater reaction causes a change in her coloring. Karl Senior is brought into the ER where Stephanie tries to save his life. As the police go to arrest Morrigan for the murder of Father Greg, Amy leads her to safety inside Brad and Penny's warehouse. Suddenly, the building begins to shake as chanting is heard from outside. Darkfin hitches a ride on Craig and Anita's helicopter. They are shocked to discover what awaits them on shore."},
 { "year": 3, "chapter": "01" ,"synopsis": "A night to remember? Or maybe not as Gracie wakes up in bed with Jason. While she attempts to piece together the events of the previous 24 hours, all hell has broken loose in Duquesa Bay."},
 { "year": 3, "chapter": "01" ,"synopsis": "Flashback to the night before. Darkfin hitches a ride on Craig and Anita&rsquo;s USCG copter. After battling the hoods on the cliff, the copter crashes, Craig is unconscious, and Darkfin saves Anita from a date with a dagger. Brad and Penny survive the quake but their shop is in ruins and Morrigan is seemingly lost in the rubble. Amethyst has actually led her to safety at the Quartz Lake Inn. Dr. Stephanie delivers the news about Karl to his family while Hector sneaks him out of the hospital."},
 { "year": 3, "chapter": "02" ,"synopsis": "Griffin finds Erika recovering in the family boathouse. She refuses to believe him about her father&rsquo;s death. Hector hides Karl at the Fiore farmhouse and spars with Stephanie over their relationship. Morrigan has a dream flashing back to when she was six and to a place where she spent the day with her pregnant mother and a mysterious priest."},
 { "year": 3, "chapter": "03" ,"synopsis": "The white robed hood leader gathers the others to discuss strategy while Amy is brought before them. Brad and Penny are confronted by the cops and Jeremy. Anita gets a call from Marcy while Ona Rosa pays her respects to the von Meers. A suspicious Erika confronts Stephanie about Karl."},
 { "year": 3, "chapter": "04" ,"synopsis": "Amethyst must choose between saving Zach or sacrificing Morrigan. Erika finds out the truth about Karl and forces Stephanie to drive to Hector&rsquo;s place. Their close call with Anita prompts a sudden move to the Quartz Lake Inn where Erika meets up with Morrigan."},
 { "year": 3, "chapter": "05" ,"synopsis": "In a moment of grief, KJ kisses Ona Rosa but Griffin drags him off to a crucial PCOC meeting. Erika asks Morrigan to stay with Karl while she works on an antidote. Justine returns home to find a gun held to her head by Joenne. Marcy and Anita handle things differently at the beach."},
 { "year": 3, "chapter": "06" ,"synopsis": "Shelby helps Erika in the lab as Javier eavesdrops. Morrigan goes to get ice for a deteriorating Karl when she is taken by the hooded Amy. Victoria warns KJ about their families at the end of the PCOC meeting. Lydia comforts Pauline while Penny has a revealing debate with Stephanie downstairs."},
 { "year": 3, "chapter": "07" ,"synopsis": "Covering Karl's supposed death for KCON, Gracie and Kylee ride back in the newsvan when they come across Justine and Joenne fleeing from the Hoods. When Erika confronts Javier over his ties to the toxin, he blames Griffin for hiring him. Big Joe dons his black robe and prepares for battle as Amy trades Morrigan to the hoods for Zach. They use the Marked One to find the right drilling spot as Mt. Wiggins erupts."},
 { "year": 3, "chapter": "08" ,"synopsis": "With a red moon rising, Stephanie prepares to use the serum on Karl. Erika fights with Griffin over the toxin for Ursula&rsquo;s cosmetics line. Sensing Morrigan is in dire straits, Erika dives off the penthouse balcony into the Santa Conchita. The hood battle claims the life of Joe but not before he throws Morrigan&rsquo;s lifeless body into the underground river. Hector reveals he is a member of The Clergy to Karl and Stephanie."},
 { "year": 3, "chapter": "09" ,"synopsis": "Craig and Anita help out with the evacuation but are nearly taken down by two military jets. Hector, Karl, and Stephanie flee from the lava as it overtakes the Quartz Lake Inn. Hooded Amy leads a bloody Zach to safety from the caves. KJ and Griffin are frantically searching the river when they come across Shelby and her young son in worship over the volcano."},
 { "year": 3, "chapter": "10" ,"synopsis": "Morrigan is brought back by Darkfin but she is not herself. After nearly taking out Darkfin with the trident, Morrigan settles down and the two run for safety through the foothills. They avoid a search helicopter and coyotes by taking shelter at Tim&rsquo;s family cabin. Darkfin tries to regenerate in the shower when Morrigan sneaks a peak and is stunned by the human silhouette."},
 { "year": 3, "chapter": "11" ,"synopsis": "Craig tries to hold Anita back as she verbally assaults the feds in charge. Gracie and Kylee call a truce to do a nationwide feed for KCON. Gracie attempts to talk to Zach about what happened. He cries that Morrigan is dead while Justine steals the newsvan. Hector and Stephanie drop off Karl at a secluded clinic. George and Lydia argue with Penny on the private jet to Sacramento when it hits unexpected turbulence."},
 { "year": 3, "chapter": "12" ,"synopsis": "On his way to the cabin, Tim is confronted by belligerent deputies. Morrigan awakens and realizes Darkfin knocked her out to keep her from discovering her identity. They finally have the chance to discuss Duquesa Bay, Nereidium, and other mysteries, one-on-one. A disguised Erika finds a way to distract the deputy at the door while Morrigan hides in the bathroom. Tim arrives at the cabin and rummages for the black bag."},
 { "year": 3, "chapter": "13" ,"synopsis": "To everyone&rsquo;s amazement, the Renselier jet lands safely. Penelope suspects something is happening to her but her parents refuse to discuss it. Erika knocks Tim out and leaves him for the deputies. She takes his bag and drives Morrigan away in the Jeep. Gracie is frustrated by Zach&rsquo;s nonsensical stories until he reveals a painful secret."},
 { "year": 3, "chapter": "14" ,"synopsis": "Erika drops Morrigan off at Amy&rsquo;s house and heads back to the hills for her trident. KJ and Griffin are arguing in the limo when they are diverted into a tunnel. Hoods surround them and Griffin introduces KJ to the white robed leader, his new business partner. Joenne and her squad clean up the battle area and come across the trident. They fire on the newsvan as it enters the perimeter."},
 { "year": 3, "chapter": "15" ,"synopsis": "Erika retrieves the trident and finishes off a hood before Joenne and the others return. The hood leader tells Griffin that the timetable has been moved up puts KJ to the test. Amethyst and Morrigan confront each other over The Clergy and their connections to it. Erika returns Tim&rsquo;s Jeep to the SCU lab and gathers supplies. Exhausted, she collapses in tears on her boat while the black bag spills its contents."},
 { "year": 3, "chapter": "16" ,"synopsis": "A week has passed since the eruption with the KCON news team reporting on the devastating aftermath. Claudia and her family board the Meeramar tanker for Karl&rsquo;s memorial. Jeremy and Gracie are planning her trip when Jason shows up. Erika and Stephanie discuss Karl when KJ confronts Erika over her disappearance. A sudden storm and an explosion rock the tanker."},
 { "year": 3, "chapter": "17" ,"synopsis": "Craig attempts to calm the panicked passengers as the ship takes on water. Ona Rosa is reflecting in church when she is strangled by a hood. Back at the farm, Hector, Carmen and Frank bicker over the land, the bracelet, and Stephanie. Marcy and Anita consider leaving Duquesa Bay when they hear about the tanker. Erika is baited by the enemy lights at sea but resists. She is forced to dive overboard to save Hannah."},
 { "year": 3, "chapter": "18" ,"synopsis": "Craig also dives in after Hannah but is knocked unconscious. Darkfin flashes back to a time with Samadara before saving both Hannah and Craig. She hands them over to an oddly behaving Penelope. Morrigan senses the doom and forces Amy to drive her to the beach. Darkfin enlists the help of her marine friends as she battles the lights. Anita and the USCG finally evacuate the ship. Later, Penny is questioned by Anita."},
 { "year": 3, "chapter": "19" ,"synopsis": "Morrigan saves Darkfin with the trident but is forced to challenge Amethyst. Morrigan and Darkfin drive to the Bay Valley Medical Center where the tanker&rsquo;s passengers are being treated. Darkfin uses the sewers to break in and get the necessary supplies. The hoods surprise Morrigan by floating past her and hurrying inside for the showdown."},
 { "year": 3, "chapter": "20" ,"synopsis": "Inside a clandestine office, Doug calls Griffin to oversee the drilling in the Kiyomis. They argue when Griffin alerts him to a potential problem. Doug and Turner posture over the power of the white robe. Penny assists a weakened Darkfin and they take on the hoods with Anita and Morrigan. Jason is killed and Hector betrays his family as a massive explosion rocks the hospital. The real white robed leader watches from a distance &#150; Samadara has returned!"}
]